/********************************************************************
// FileName: e:\Code\FK_3D\FK_Encryption\FK_Encryption\Include\DESEncryption.h
// Date:     2007年11月21日
// Author:   FreeKnightDuzhi
// Comment:  
*********************************************************************/

#pragma once


extern "C"
{
	#include "d3des.h"
}
//--------------------------------------------------------------------------------------------------------------------------------------------------------------
// 对应DES压缩块大小（使用不同的加密法）
enum DES_Layer
{
	DES_1	= 0,		// 8位加密法
	DES_2	= 1,		// 16位加密法
	DES_3	= 2,		// 24位加密法
};
// DES压缩块大小
static const size_t DES_pBlockLength[3] = { 8, 16, 24 };
//--------------------------------------------------------------------------------------------------------------------------------------------------------------
// 预计算加密一段数据所需空间大小
/*
	param : eLayer	加密方式
			nLen	明文长度
	return : 加密该明文需要的临时空间
*/
size_t DES_GetEncryptedSize( DES_Layer eLayer, const size_t nLen );
//--------------------------------------------------------------------------------------------------------------------------------------------------------------
// 加密一段数据
/*
	param : eLayer	加密方式
			pKey	Key
			OUT pOutData	输出密文
			OUT	nOutLen		输出密文长度
			pInData			需要加密的明文
			nInLen			明文长度
	return : 输出的密文长度

	//-------------------------------------------------------------------------------
	Warning!!! 密文必定与明文相同大小，甚至大于明文，不可给予一个小于明文的加密空间。
	//-------------------------------------------------------------------------------
*/		
size_t DES_Encrypt( DES_Layer eLayer, const unsigned char* pKey, void* pOutData, const size_t nOutLen, const void* pInData, const size_t nInLen );
//--------------------------------------------------------------------------------------------------------------------------------------------------------------
// 解密一段数据
/*
	param : eLayer	解密方式
			pKey	Key
			pData	需要解密的文件 / 同时，解密后的明文也会 OUT 出来
			nInLen	需要解密的文件长度
	return : 解密后文件长度
*/
size_t DES_Decrypt( DES_Layer eLayer, const unsigned char* pKey, void* pData, const size_t nInLen );
//--------------------------------------------------------------------------------------------------------------------------------------------------------------